# Сафин Антон - "Economics - МЭ - 3"

### Группа: 10 - МЭ - 3
### Электронная почта: antonexperience@gmail.com
### VK: www.vk.com/id179785115


**[ НАЗВАНИЕ ПРОЕКТА ]**

“Economics”

**[ ПРОБЛЕМНОЕ ПОЛЕ ]**

В настоящий момент времени не существует приложений, которые содержат информацию необходимую для решения типовых задач по олимпиданой экономике.
Также нет ни одного приложения, которое бы складывала КПВ, строила КТВ и пересекала спрос и предложение состоящих из нескольких участков.
"Economics" позволит все это сделать, и повторить краткую теория по олимпиданой экономике.

**[ ЗАКАЗЧИК / ПОТЕНЦИАЛЬНАЯ АУДИТОРИЯ ]**

Программный продукт может заинтересовать учащихся профильных экономических классов, так как, он дает им необходимую информацию и функционал.

* Учащиеся МЭ и СЭ классов Лицея "НИУ ВШЭ"
* Учащиеся других школ с направлением - экономика”
* Преподаватели, составители задач

**[ АППАРАТНЫЕ ТРЕБОВАНИЯ ]** 

Продукт разрабатывается под операционную систему android

* Android – версия Lollipop (Android 5.0 2014 год) и выше, 200 мб свободного места, 20мб оперативной памяти
**[ ФУНКЦИОНАЛЬНЫЕ ТРЕБОВАНИЯ ]**

Программный продукт будет предоставлять следующие возможности:
* Сложение линейных КПВ
* Построение КТВ при заданных Px/Py(условно)

**[ ПОХОЖИЕ / АНАЛОГИЧНЫЕ ПРОДУКТЫ ]**

Анализ сайта https://iloveeconomics.ru, показал, что:

* на нем находится информацию по решению задач, но отсутсвет функция сложения КПВ и построения КТВ.Также это является сайтом а не приложением.

**[ ИНСТРУМЕНТЫ РАЗРАБОТКИ ]**

*	Kotlin / Android Studio – для разработки Android-версии

**[ ЭТАПЫ РАЗРАБОТКИ ]**

*	Разработка пользовательских сценариев
*	Проектирование интерфейса
*	Создание решения задач в общем виде.
*	Запуск Android версии продукта
*	Тестирование, отладка
*	Подготовка проекта к защите

**[ ВОЗМОЖНЫЕ РИСКИ ]**

*   Другие аппаратные требования
*	Невозможность создания решения в общем виде из-за большого количества идейно различных задач.
*	Трудности с реализацией билиотеки графиков в приложении
*	Неправильная оценка стека технологий, которые мне необходимо изучить, как следствие – нехватка времени на изучение необходимых языков программирования, фреймворков и т. п.